blogger/app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
---
	def destroy
		@tag = Tag.find(params[:id])
		@tag.destroy